#+TITLE:  python
#+OPTIONS: num:nil
#+SETUPFILE: /home/silin/.emacs.d/org-html-themes/org/theme-bigblow.setup
#+STARTUP: overview
** map and for
#+BEGIN_SRC python :results output
list1 = [ord(x) for x in 'ABC']
print(list1)

list2 = map(ord, 'ABC')
print(list2)

#+END_SRC

#+RESULTS:
: [65, 66, 67]
: [65, 66, 67]

** multiply
#+BEGIN_SRC python :results output
print('A'*3)
print(['A']*3)
print([['A']]*3)

#+END_SRC

#+RESULTS:
: AAA
: ['A', 'A', 'A']
: [['A'], ['A'], ['A']]

** useful expression
conditional express
#+begin_src python :results output
condition = True
x = 1 if condition else 0
print(x)

#+end_src

#+RESULTS:
: 1

Large Number  Formation
#+begin_src python :results output

num1 = 100_000_000_000
num2 = 10_000_000
print(f'{num1 + num2 :,}')

#+end_src

#+RESULTS:
: 100,010,000,000


open with
#+begin_src python :results output
with open('pycharm_keybounding.org','r') as f:
    file= f.read()
words = file.split(' ')


#+end_src

#+RESULTS:

enumerate
#+begin_src python :results output
names = ['one', 'two', 'three', 'four']
for index, name in enumerate(names, start=1):
    print(index,name)

#+end_src

#+RESULTS:
: 1 one
: 2 two
: 3 three
: 4 four


zip
#+begin_src python :results output
  names = ['one', 'two', 'three', 'four']
  hero = ['ni', 'wo', 'ta', 'bu']

  for name, h in zip(names, hero):
      print(f'{name} is actually {h}')
#+end_src

#+RESULTS:
: one is actually ni
: two is actually wo
: three is actually ta
: four is actually bu


unpacking tuple
#+begin_src python :results output
a, b, *_ = (1,2,3, 4,5)
a, b, *f = (1,2,3, 4,5)
c, d, _ = (1,2,3)
print(a)
print(b)

#+end_src

#+RESULTS:
: 1
: 2


setattr, 

getattr


#+begin_src python
from getpass import getpass
password = getpass('Password:')
#+end_src


python -m model
直接执行model模块
** generator

use yield stead of return

#+begin_src python :results output
  def func (lst):
      lt = []
      for i in lst:
          lt.append( i*i)
      return lt
  num = func([ x for x in range(8)])
  print(num)
  num1 = [ x*x for x in range(8)]
  print(num1)


  #generator
  def funcg (lst):
      for i in lst:
          yield (i*i)

  numg = funcg([ x for x in range(8)])
  print(numg)
  numg1 = ( x*x for x in range(8))
  print(numg1)
        


#+end_src

#+RESULTS:
: [0, 1, 4, 9, 16, 25, 36, 49]
: [0, 1, 4, 9, 16, 25, 36, 49]
: <generator object funcg at 0x7f6b248da4d0>
: <generator object <genexpr> at 0x7f6b248dac50>
** Break Points

#+BEGIN_SRC 
else sentence after for: after for sentence else can be used

def fun(argument, *argument, **argument)
fun(single_value, tuple, dictionary)
#+END_SRC

 lambda with funtion
#+BEGIN_SRC python :results output
def fun(n):
    return lambda x: x+n
print(fun(3)(4))
#+END_SRC

#+RESULTS:
: 7




#+BEGIN_SRC 
nonlocal将变量的赋值,且将此值向外层作用域扩展一个范

global 将变量的赋值到程序的全局作用域
#+END_SRC

#+BEGIN_SRC 

 _ value: 在交互模式下，上一次打印出来的表达式被赋值给变量 _

 import test.py file as a model
 import test
 so all funtions and parameters can be called as in a test class
#+END_SRC

#+BEGIN_SRC 

python -i test.py 
after execute test.py file, terminal will get into python console, 
and all funtions and parameters can just be called.
#+END_SRC
** decorator
1, @后没有参数，则被修饰函数名被传到修饰函数作参数
2, @后有参数，在该参数被传到修饰函数作参数，而被修饰函数可在其定义内被
接收
#+BEGIN_SRC python :results output :session
  def log(func):
      def wrapper(*args, **kw):
          print('call function %s():' % func.__name__)
          return func(*args, **kw)
      return wrapper

  def loog(text):
      def decorator(fun):
          def wrapper(*args, **kw):
              print('kkcall function %s with %s():' % (fun.__name__, text))
              return fun(*args, **kw)
          return wrapper
      return decorator



  @loog('exit')
  def now():
      print("now to start")

  now()
#+END_SRC

#+RESULTS:
: kkcall function now with exit():
: now to start

** functools
#+BEGIN_SRC python :results output
import functools
int2 = functools.partial(int, base=3)
print(int2('1211'))

#+END_SRC

#+RESULTS:
: 49

** Polymorphism
#+BEGIN_SRC python :results output :session
  class Animal(object):
      def __init__(self):
          self.name ='Animal name'

      def run(self):
          print('Animal is running')

  class Dog(Animal):
      def __init__(self):
          self.name ='Dog name'
      def run(self):
          print('Dog is running')

  class Cat(Animal):
      def __init__(self):
          self.name ='Cat name'
      def run(self):
          print('Cat is running')

  class Tortoise(Animal):
      def __init__(self):
          self.name ='Tortoise name'
      def run(self):
          print('Tortoise is running slowly')
            
  # Polymorphism, all Class or instance will be checked the best passing
  # mothode or character
  def run_twice(a):
      a.run()

  def name(b):
      print(b.name)

  dog = Dog()
  cat = Cat()

  
  run_twice(Animal())
  run_twice(Dog())
  run_twice(Cat())
  run_twice(dog)
  
  name(Animal())
  name(Dog())
  name(dog)

#+END_SRC

#+RESULTS:
: Animal is running
: Animal is running
: Dog is running
: Cat is running
: Dog is running
: Animal name
: Dog name
: Dog name

** generator
#+BEGIN_SRC python :results output :session
  def something():
      result = []
      for _ in range(10):
          result.append(2)
      return result
  print(something())


  def iter_some():
      x = 0
      for _ in range(10):
          yield x
          x += 1
  a = iter_some()
  print(next(a))
  print(next(a))
  print(next(a))

#+END_SRC

#+RESULTS:
: [2, 2, 2, 2, 2, 2, 2, 2, 2, 2]
: 0
: 1
: 2

#+BEGIN_SRC python :results output :session

  def fib ():
      a = b = 1
      yield a
      yield b
      while True:
          a, b = b, a+b
          yield b
        

  for var in fib():
      if var > 100:
          break
      print(var)
    
            

#+END_SRC

#+RESULTS:
#+begin_example
1
1
2
3
5
8
13
21
34
55
89
#+end_example

** Decorator
decorator just rewrite the function, using call function as argument
#+begin_src python :results output
  def decorator_function(original_function):
      def wrapper_function(*arg, **kwargs):
          print("using wrapper, and  the name is {}, and the age".format(original_function.__name__))
          return original_function(*arg, **kwargs)
      return wrapper_function

  class decorator_class(object):
      def __init__(self, original_function):
          self.original_function = original_function
      def __call__(self, *arg, **kwargs):
          print("using the decorator class")
          return self.original_function(*arg, **kwargs)

  print("////////function decor without augurment//////////////////////")
  def display():
      print("display this")
  display = decorator_function(display)
  display()
  print("////////decorator decor without augurment//////////////////////")
  @decorator_function
  def display1():
      print("display1 this")
  display1()
  print("////////function decor with augurment//////////////////////")
  def display_info(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info = decorator_function(display_info)
  display_info("Xiang", 21)
  print("////////decorator decor with augurment//////////////////////")
  @decorator_function
  def display_info1(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info1("Xiang", 21)
  print("/////////class decorator decor/////////////////////")
  @decorator_class
  def display_info_class(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info_class("Xiang", 21)
  print("////////class function decor//////////////////////")
  def display_info_class(name, age):
      print("display the name is {}, and the age is {}".format(name, age))
  display_info_class1 = decorator_class(display_info_class)
  display_info_class1("Xiang", 21)



#+end_src

#+RESULTS:
#+begin_example
////////function decor without augurment//////////////////////
using wrapper, and  the name is display, and the age
display this
////////decorator decor without augurment//////////////////////
using wrapper, and  the name is display1, and the age
display1 this
////////function decor with augurment//////////////////////
using wrapper, and  the name is display_info, and the age
display the name is Xiang, and the age is 21
////////decorator decor with augurment//////////////////////
using wrapper, and  the name is display_info1, and the age
display the name is Xiang, and the age is 21
/////////class decorator decor/////////////////////
using the decorator class
display the name is Xiang, and the age is 21
////////class function decor//////////////////////
using the decorator class
display the name is Xiang, and the age is 21
#+end_example

** with * **
#+begin_src ipython :results output :exports both
  def function_with_one_star(*d):
      print(d)

  def function_with_two_stars(**d):
      print(d)

  function_with_one_star(1,2,3)

  function_with_two_stars(a=1, b=2, c=3)


#+end_src

#+RESULTS:
: (1, 2, 3)
: {'a': 1, 'b': 2, 'c': 3}

** statistical mothode
#+BEGIN_SRC python :results output
  from scipy import stats
  from scipy.stats import norm
  import numpy as np
  import scipy as sp
  print(sp.stats.t.ppf(0.95,6))
  print(norm.cdf([-1,0,1]))
  print(norm.cdf(np.array([-1,0,1])))
  print(norm.mean(), norm.std(), norm.var() )
  print(norm.pdf(0))
  print(norm.cdf(1.96))
  print(norm.ppf(0.975))
  print(norm.cdf(1))
  print(norm.ppf(0.841344746090))
  print(norm.sf(1-norm.cdf(1)))
  print(norm.ppf(0.9))
  print(stats.t.ppf(0.975,3))
  print(stats.t.ppf(0.975,3))

#+END_SRC

#+RESULTS:
#+begin_example
1.9431802803927816
[0.15865525 0.5        0.84134475]
[0.15865525 0.5        0.84134475]
0.0 1.0 1.0
0.3989422804014327
0.9750021048517795
1.959963984540054
0.8413447460685429
1.0000000000886762
0.4369702468636344
1.2815515655446004
3.182446305284263
3.182446305284263
#+end_example

*** os.listdir()
#+begin_src ipython  :results output :exports both
print(os.listdir())
#+end_src

#+RESULTS:
: []

*** cpu with cuda.gpu 
#+begin_src ipython :results output

  import torch
  import time
  print(torch.__version__)
  print(torch.cuda.is_available)

  a = torch.randn(10000, 1000)
  b = torch.randn(1000, 2000)

  t0 = time.time()
  c = torch.matmul(a, b)
  t1 = time.time()
  print(a.device, t1-t0, c.norm(2))

  device = torch.device('cuda')
  a = a.to(device)
  b = b.to(device)

  t0 = time.time()
  c = torch.matmul(a, b)
  t2 = time.time()
  print(a.device, t2-t0, c.norm(2))


  t0 = time.time()
  c = torch.matmul(a, b)
  t2 = time.time()
  print(a.device, t2-t0, c.norm(2))
#+end_src

#+RESULTS:
: 1.7.0+cu101
: <function is_available at 0x7f58ba0e9d90>
: cpu 0.22681307792663574 tensor(141040.8438)
: cuda:0 0.004456043243408203 tensor(141442.0938, device='cuda:0')
: cuda:0 0.00037932395935058594 tensor(141442.0938, device='cuda:0')

*** auto Derivative

#+begin_src ipython :results output
  import torch
  from torch import autograd

  x = torch.tensor(1.)
  a = torch.tensor(1. , requires_grad=True)
  b = torch.tensor(2. , requires_grad=True)
  c = torch.tensor(3. , requires_grad=True)

  y = a**2*x + b*x + c

  print('before:', a.grad, b.grad, c.grad)
  grad = autograd.grad(y, [a,b,c])
  print('after:', grad[0], grad[1], grad[2])

#+end_src

#+RESULTS:
: before: None None None
: after: tensor(2.) tensor(1.) tensor(1.)

*** small example
#+begin_src ipython :results output
  import torch

  x = torch.ones(2,2,requires_grad=True)
  y = x +2
  z = y*y*3
  out = z.mean()
  out.backward()
  print(x.grad)

#+end_src

#+RESULTS:
: tensor([[4.5000, 4.5000],
:         [4.5000, 4.5000]])


\begin{equation}
x = 
  \left(
  \begin{array}{cc}
          1  & 1  \\
          1  & 1 \\
  \end{array}
  \right)
\end{equation}



\begin{equation}
y =    2 + x =
  \left(
  \begin{array}{cc}
          3  & 3  \\
          3  & 3 \\
  \end{array}
  \right)
\end{equation}


\begin{equation}
z =   3*y*y =
  \left(
  \begin{array}{cc}
          27  & 27  \\
          27  & 27 \\
  \end{array}
  \right)
\end{equation}

$$ out = \frac{1}{4}\sum_{i=1,j=1}^{i=2, j=2}3y_{ij}y_{ij} =\frac{1}{4}\sum_{i=1,j=1}^{i=2, j=2}3(2+x_{ij})(2+x_{ij}) $$

x.grad is to say :
$$ \frac{d(out_{ij})}{d(x_{ij})}  = 3(2+4)/4 = 4.5$$ 








** Iterator DataLoader

here, THE i is the number of iterations, each iteration has 20 iter
#+begin_src ipython :results output
  import torch
  import numpy as np

  i = np.array([a for a in range(100)])
  i = torch.from_numpy(i)

  test = torch.utils.data.DataLoader(i, batch_size=20,shuffle=False)
  testiter = iter(test)

  for k, data in enumerate(testiter):
      print(k)


#+end_src

#+RESULTS:
: 0
: 1
: 2
: 3
: 4

** torch.max
the return is a namedtuple
dim = 0, 1, maximum of rows or columns
#+begin_src ipython :results output
import torch
i = torch.randn(3,4)
print(torch.max(i, 0))
print(torch.max(i, 1))

#+end_src

#+RESULTS:
: torch.return_types.max(
: values=tensor([-0.1560,  0.1561,  0.9781,  0.4501]),
: indices=tensor([1, 0, 1, 0]))
: torch.return_types.max(
: values=tensor([0.4904, 0.9781, 0.2857]),
: indices=tensor([2, 2, 2]))



*** plot.scatter()
#+begin_src python :results output
  import pandas as pd
  import numpy as np
  a = pd.DataFrame(np.random.rand(3,2))
  print(a)
  a.plot.scatter(x=0, y = 1)


#+end_src

#+RESULTS:
:           0         1
: 0  0.768941  0.501116
: 1  0.514047  0.526439
: 2  0.843669  0.523868

*** multiply

#+BEGIN_SRC python   :results output :session

  import tensorflow as tf
  #创建常量
  m1= tf.constant([[3,3]])
  m2=tf.constant([[1],[2]])
  #相乘
  product = tf.matmul(m1,m2)
  print(product)

  #定义一个会话，启动默认图
  sess = tf.Session()
  #调用sess，执行乘法运算
  result = sess.run(product)
  print(result)
  #不要忘了关闭sess
  sess.close()

  with tf.Session() as sess:
      result = sess.run(product)
      print(result)
  #使用with不需要专门关闭sess


#+END_SRC

#+RESULTS:
: Tensor("MatMul:0", shape=(1, 1), dtype=int32)
: [[9]]
: [[9]]

*** the first using of variable & subtract add 
#+BEGIN_SRC python :results output
  import tensorflow as tf
  x = tf.Variable([1,2])
  a = tf.constant([3,3])
  sub = tf.subtract(x,a)
  add = tf.add(x,sub)
# 对于变量，要初始化init
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(sess.run(sub))
      print(sess.run(add))


#+END_SRC

#+RESULTS:
: [-2 -1]
: [-1  1]

*** assign a value for variable and update & assign 
#+BEGIN_SRC python :results output
  #............................．．．．．．变量计算
  #变量可以被起名，初始化为０
  import tensorflow as tf
  state = tf.Variable(0, name = 'counter')
  new_value = tf.add(state,1)
  #赋值功能assign
  update = tf.assign(state,new_value)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      print(state)
      for _ in range(5):
          sess.run(update)
          print(sess.run(state))
          print(sess.run(update))


#+END_SRC

#+RESULTS:
#+begin_example
<tf.Variable 'counter:0' shape=() dtype=int32_ref>
1
2
3
4
5
6
7
8
9
10
#+end_example

*** fetch and Feed &placeholder
#+BEGIN_SRC python :results output
  import tensorflow as tf
  # Fetch 在一个会话里执行多个op
  input1 = tf.constant(3.0)
  input2 = tf.constant(2.0)
  input3 = tf.constant(5.0)

  add = tf.add(input2,input3)
  mul = tf.multiply(input1,add)

  with tf.Session() as sess:
      result = sess.run([add,mul])  #有[]
      print(result)

  #------------------Feed
  #创建占位符
  input4= tf.placeholder(tf.float32)
  input5 = tf.placeholder(tf.float32)
  output = tf.multiply(input4, input5)
  with tf.Session() as sess:
      print(sess.run(output,feed_dict = {input4:[7.0],input5:[2.0]}))  #随后赋值是用字典的方式进行的feed_dict = {input4:[7.0],input5:[2.0]}, 数字还加了方括号．


#+END_SRC

#+RESULTS:
: [7.0, 21.0]
: [14.]

*** the first train case
#+BEGIN_SRC python :results output
  import tensorflow as tf
  import numpy as np
  import matplotlib.pyplot as plt
  #生成随机数据
  x_date = np.random.rand(100)
  y_date = x_date*0.4 + 2

  #构造线性模型
  b = tf.Variable(0.)
  k = tf.Variable(0.)
  y = k*x_date + b

  #构造二次代价函数
  loss = tf.reduce_mean(tf.square(y_date-y))
  #定义梯度下降的优化器
  optimizer = tf.train.GradientDescentOptimizer(0.2)
  #定义一个最小化代价函数
  train = optimizer.minimize(loss)
  init = tf.global_variables_initializer()
  with tf.Session() as sess:
      sess.run(init)
      for steps in range(201):
          sess.run(train)
          if steps%20 == 0:
              print(steps, sess.run([k,b]))
      prediction_value = sess.run(y)
      plt.figure()
      plt.scatter(x_date, y_date)
      plt.plot(x_date,prediction_value,'r-',lw=5)
      plt.show()



#+END_SRC

#+RESULTS:
#+begin_example
0 [0.44114023, 0.87820524]
20 [0.7041128, 1.841991]
40 [0.58822596, 1.9022033]
60 [0.5164994, 1.9394703]
80 [0.47210538, 1.9625362]
100 [0.44462854, 1.9768122]
120 [0.4276222, 1.9856484]
140 [0.4170963, 1.9911172]
160 [0.41058153, 1.9945022]
180 [0.40654916, 1.9965973]
200 [0.40405348, 1.9978939]
#+end_example

*** a simple CNN case
#+BEGIN_SRC python  :results output
  import tensorflow as tf
  import numpy as np
  BATCH_SIZE = 8
  seed = 23455

  rng = np.random.RandomState(seed)
  X = rng.rand(32, 2)
  Y = [[int(X0+X1 < 1)] for (X0, X1) in X]
  # print ("X is :", X)
  # print ("Y is :", Y)

  x = tf.placeholder(tf.float32, shape = (None, 2))
  y_ = tf.placeholder(tf.float32, shape = (None, 1))

  w1 = tf.Variable(tf.random_normal([2,3], stddev=1, seed=1))
  w = tf.Variable(tf.random_normal([3,3], stddev=1, seed=1))
  w2 = tf.Variable(tf.random_normal([3,1], stddev=1, seed=1))

  a = tf.matmul(x,w1)
  b = tf.matmul(a,w)
  y = tf.matmul(b,w2)

  loss = tf.reduce_mean(tf.square(y-y_))
  train_step = tf.train.GradientDescentOptimizer(0.001).minimize(loss)

  with tf.Session() as sess:
      init_op = tf.global_variables_initializer()
      sess.run(init_op)
      print("w1 is :", sess.run(w1))
      print("w is :", sess.run(w))
      print("w2 is :", sess.run(w2))

      steps= 30000
      for i in range(steps):
          start = (i*BATCH_SIZE) % 32
          end = start + BATCH_SIZE
          sess.run(train_step, feed_dict={x:X[start:end], y_:Y[start:end]})
          if i % 5000 == 0:
              total_loss = sess.run(loss, feed_dict={x:X, y_:Y})
              print("After %d training steps, loss on all data is %g" %(i,total_loss))
      print("\n")
      print("w1 is :", sess.run(w1))
      print("w is :", sess.run(w))
      print("w2 is :", sess.run(w2))

#+END_SRC

#+RESULTS:
#+begin_example
w1 is : [[-0.8113182   1.4845988   0.06532937]
 [-2.4427042   0.0992484   0.5912243 ]]
w is : [[-0.8113182   1.4845988   0.06532937]
 [-2.4427042   0.0992484   0.5912243 ]
 [ 0.59282297 -2.1229296  -0.72289723]]
w2 is : [[-0.8113182 ]
 [ 1.4845988 ]
 [ 0.06532937]]
After 0 training steps, loss on all data is 27.0734
After 5000 training steps, loss on all data is 0.383562
After 10000 training steps, loss on all data is 0.383562
After 15000 training steps, loss on all data is 0.383562
After 20000 training steps, loss on all data is 0.383562
After 25000 training steps, loss on all data is 0.383561


w1 is : [[-0.84913164  1.3203508   0.219825  ]
 [-1.9427874   0.7993799  -0.2589098 ]]
w is : [[-0.31725118  0.802253    0.02743915]
 [-2.471998    0.16294315  0.5947651 ]
 [ 0.56031865 -2.0743563  -0.7197714 ]]
w2 is : [[-0.45712712]
 [ 0.67528236]
 [ 0.02388799]]
#+end_example

*** read date for variables
#+BEGIN_SRC python :results output
  from tensorflow.examples.tutorials.mnist import input_data
  mnist = input_data.read_data_sets('./data', one_hot = True)

  # print(mnist.train.labels[0])
  # print(mnist.train.images[0])

  BATCH_SIZE = 200
  xs, ys = mnist.train.next_batch(BATCH_SIZE)
  print("xs shape :", xs.shape)
  print("ys shape :", ys.shape)


#+END_SRC

#+RESULTS:
: Extracting ./data/train-images-idx3-ubyte.gz
: Extracting ./data/train-labels-idx1-ubyte.gz
: Extracting ./data/t10k-images-idx3-ubyte.gz
: Extracting ./data/t10k-labels-idx1-ubyte.gz
: xs shape : (200, 784)
: ys shape : (200, 10)




#+startup: content
*** basic
#+BEGIN_SRC python :results output
  # View more python tutorials on my Youtube and Youku channel!!!

  # Youtube video tutorial: https://www.youtube.com/channel/UCdyjiB5H8Pu7aDTNVXTTpcg
  # Youku video tutorial: http://i.youku.com/pythontutorial

  # 4 - basic usage
  #   from __future__ import print_function
  import numpy as np
  import theano.tensor as T
  from theano import function

  # basic
  x = T.dscalar('x')
  y = T.dscalar('y')
  z = x+y     # define the actual function in here
  f = function([x, y], z)  # the inputs are in [], and the output in the "z"

  print(f(2,3))  # only give the inputs "x and y" for this function, then it will calculate the output "z"

  # # to pretty-print the function
  from theano import pp
  print(pp(z))

  # # how about matrix
  x = T.dmatrix('x')
  y = T.dmatrix('y')
  z = x + y
  f = function([x, y], z)
  print(f(np.arange(12).reshape((3,4)), 10*np.ones((3,4))))


#+END_SRC

#+RESULTS:
: 5.0
: (x + y)
: [[10. 11. 12. 13.]
:  [14. 15. 16. 17.]
:  [18. 19. 20. 21.]]

*** check

#+BEGIN_SRC ipython :results output
  import tensorflow as tf
  if (tf.test.is_gpu_available(cuda_only=False, min_cuda_compute_capability=None)==True):
      print("using gpu")
#+END_SRC

#+RESULTS:
: WARNING:tensorflow:From <ipython-input-3-77a0022b7707>:2: is_gpu_available (from tensorflow.python.framework.test_util) is deprecated and will be removed in a future version.
: Instructions for updating:
: Use `tf.config.list_physical_devices('GPU')` instead.
: using gpu



#+begin_src ipython  :results output
  import sys
  print(sys.version)
#+end_src

#+RESULTS:
: 2.7.17 (default, Sep 30 2020, 13:38:04) 
: [GCC 7.5.0]







** chapter 01 code

一个很简单的例子，用tf来求某个函数的导数
#+BEGIN_SRC python :results output
import tensorflow as tf
a = tf.constant(1.)
b = tf.constant(2.)
c = tf.constant(3.)
w = tf.constant(4.)

with tf.GradientTape() as tape:
    tape.watch([w])
    y = a*w**2 + b*w + c
[dy_dw] = tape.gradient(y, [w])
print(dy_dw)

#+END_SRC


检测cpu和gpu运行时的时间对比
#+begin_src python :results output 
  import tensorflow as tf
  import timeit

  n = 10000000
  with tf.device('/cpu:0'):
      cpu_a = tf.random.normal([1, n])
      cpu_b = tf.random.normal([n, 1])

  with tf.device('/gpu:0'):
      gpu_a = tf.random.normal([1, n])
      gpu_b = tf.random.normal([n, 1])

  def cpu_run():
      with tf.device('/cpu:0'):
          c = tf.matmul(cpu_a, cpu_b)
      return c

  def gpu_run():
      with tf.device('/gpu:0'):
          c = tf.matmul(gpu_a, cpu_b)
      return c

  cpu_time = timeit.timeit(cpu_run, number=10)
  gpu_time = timeit.timeit(cpu_run, number=10)
  print('run time: ', cpu_time, gpu_time)



#+end_src

#+RESULTS:
: run time:  0.0974298170003749 0.09593267899981583

不用tensorflow的API，使用纯函数来实现神经网络训练的例子
#+begin_src python :results output
import numpy as np
data = []
for i in range(100):
    x = np.random.uniform(-10., 10)
    y = 1.477*x + 0.089 + np.random.normal(0., 0.01)
    data.append([x, y])
data = np.array(data)


def mse(b, w, points):
    totalError = 0
    for i in range(0, len(points)):
        x = points[i, 0]
        y = points[i, 1]
        totalError += (y-(w*x+b))**2
    return totalError/float(len(points))


def step_gradient(b_current, w_current, points, lr):
    b_gradient = 0
    w_gradient = 0
    M = float(len(points))
    for i in range(0, len(points)):
        x = points[i, 0]
        y = points[i, 1]
        b_gradient += (2/M)*((w_current*x+b_current)-y)
        w_gradient += (2/M)*x*((w_current*x + b_current)-y)
    new_b = b_current - (lr*b_gradient)
    new_w = w_current - (lr*w_gradient)
    return [new_b, new_w]


def gradient_descent(points, staring_b, staring_w, lr, num_iterations):
    b = staring_b
    w = staring_w
    for step in range(num_iterations):
        b, w = step_gradient(b, w, np.array(points), lr)
        loss = mse(b, w, points)
        if step % 5000  == 0:
            print(f"iterations:{step}, loss :{loss}, w:{w}, b:{b}")
    return [b, w]


def main():
    lr = 0.001
    initial_b = 0
    initial_w = 0
    num_iterations = 100000
    [b, w] = gradient_descent(data, initial_b, initial_w, lr, num_iterations)
    loss = mse(b, w, data)
    print(f"Final loss :{loss}, w:{w}, b:{b}")


# if __name__ ==' __main__':
main()


#+end_src

#+RESULTS:
#+begin_example
iterations:0, loss :70.10079414302263, w:0.11067024890672035, b:0.003952550528332437
iterations:5000, loss :0.00010199717063390048, w:1.4769704836166537, b:0.08946956663994972
iterations:10000, loss :0.00010199716394347099, w:1.4769703908814773, b:0.08947221136809669
iterations:15000, loss :0.00010199716394347127, w:1.4769703908749494, b:0.08947221155430594
iterations:20000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:25000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:30000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:35000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:40000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:45000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:50000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:55000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:60000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:65000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:70000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:75000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:80000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:85000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:90000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
iterations:95000, loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
Final loss :0.0001019971639434711, w:1.476970390874949, b:0.08947221155431519
#+end_example

** Make_moons

all import 
#+begin_src python  :session make_moons
  import seaborn as sns
  import matplotlib.pyplot as plt
  #+end_src
#+RESULTS:


generate the data
#+begin_src python  :results output :session make_moons  
  from sklearn.datasets import make_moons
  from sklearn.model_selection import train_test_split
  N_samples = 2000
  Test_size = 0.3
  X, y = make_moons(n_samples = N_samples, noise = 0.2, random_state=100)
  X_train, X_test, y_train, y_test = train_test_split(X, y,test_size = Test_size, random_state = 42)
  print(X.shape, y.shape)
  def make_plot(X, y, plot_name, file_name=None, XX=None, YY=None, preds=None,dark=False):
      if(dark):
          plt.style.use('dark_background')
      else:
          sns.set_style("whitegrid")
      plt.figure(figsize=(16,12))
      axes = plt.gca()
      axes.set(xlabel="$x_1$", ylabel="$x_2$")
      plt.title(plot_name,fontsize=30)
      plt.subplots_adjust(left=0.20)
      plt.subplots_adjust(right=0.8)
      if(XX is not None and YY is not None and preds is not None):
          plt.contourf(XX,YY,preds.reshape(XX.shape), 25, alpha=1,cmap = cm.Spectral)
          plt.contour(XX,YY, preds.reshape(XX.shape), levels=[.5],cmap="Greys", vmin=0,vmax=0.6)
          plt.scatter(X[:,0],X[:,1],c=y.ravel(), s=40, cmap=plt.cm.Spectral,edgecolors='none')
          plt.savefig('data.svg')
          plt.close()
  make_plot(X,y,None,"Classification Dataset Visualization")
#+end_src
#+RESULTS:
: (2000, 2) (2000,)


generate the  signal Layer class
#+begin_src python :session make_moons
  class Layer:
      def __init__(self, n_input, n_neurons,activation=None, weight=None,bias=None):
          self.weight = weight if weight is not None else np.random.randn(n_input,n_neurons)*np.sqrt(1/n_neurons)
          self.bias = bias if bias is not None else np.random.rand(n_neurons)*0.1
          self.activation = activation
          self.last_activation = None
          self.error = None
          self.delta = None
      def activate(self,x):
          r = np.dot(x, self.weight)+self.bias
          self.last_activation = self._apply_activation(r)
          return self.last_activation
      def _apply_activation(self, r):
          if self.activation is None:
              return r
          elif self.activation == 'relu':
              return np.maximum(r,0)
          elif self.activation == 'tanh':
              return np.tanh(r)
          elif self.activation == 'sigmoid':
              return 1/(1+np.exp(-r))
          return r
      def apply_activation_derivative(self, r):
          if self.activation is None:
              return np.ones_like(r)
          elif self.activation == 'relu':
              grad = np.array(r, copy=True)
              grad[r>0] = 1.
              grad[r<=0] =0.
              return grad
          elif self.activation == 'tanh':
              return 1-r**2
          elif self.activation == 'sigmoid':
              return r*(1-r)
          return r
            
#+end_src
#+RESULTS:
| 2000 | 2 |

generate the multi Layers Class NeuralNetwork
#+begin_src python :session make_moons
  class NeuralNetwork:
      def __init__(self):
          self._layers = []
      def add_layer(self, layer):
          self._layers.append(layer)
      def feed_forward(self, X):
          for layer in self._layers:
              X = layer.activate(X)
          return X

      def backpropagation(self, X, y,learning_rate):
          output = self.feed_forward(X)
          for i in reversed(range(len(self._layers))):
              layer = self._layers[i]
              if layer == self._layers[-1]:
                  layer.error = y-output
                  layer.delta = layer.error*layer.apply_activation_derivative(output)
              else:
                  next_layer = self._layers[i+1]
                  layer.error = np.dot(next_layer.weights, next_layer.delta)
                  layer.delta = layer.error*layer.apply_activation_derivative(layer.last_activation)

          for i in range(len(self._layers)):
              layer = self._layers[i]
              o_i = np.atleast_2d(X if i == 0 else  self._layers[i-1].last_activation)
              layer.weights += layer.delta*o_i.T*learning_rate


      def train(self, X_train, X_test, y_train, y_test, learning_rate, max_epochs):
          y_onehot = np.zeros((y_train.shape[0],2))
          y_onehot[np.arange(y_train.shape[0]),y_train] =1
          mses = []
          for i in range(max_epochs):
              for j in range(len(X_train)):
                  self.backpropagation(X_train[j], y_onehot[j], learning_rate)
              if i%10 == 0:
                  mse = np.mean(np.square(y_onehot - self.feed_forward(X_train)))
                  mses.apply(mse)
                  print('Epoch : #%s, MSE: %f' %(i, float(mse)))
                  print('Accuracy: %.2f%%' %(self.accuracy(self.predict(X_test),y_test.flatten())*100))
          return mses


#+end_src
#+RESULTS:

#+begin_src  python :session make_moons
nn = Neuralnetwork()
nn.add_layer(Layer (2, 25, 'sigmoid'))
nn.add_layer(Layer(25, 50, 'sigmoid'))
nn.add_layer(Layer(50, 25, 'sigmoid'))
nn.add_layer(Layer(25, 2, 'sigmoid'))
nn.backpropagation(X_train,y_train,0.001)
nn.train(X_train, X_test, y_train, y_test, 0.001,20)


#+end_src
#+RESULTS:

different Layers
#+begin_src python :session make_moons
  for n in range(5):
      model = Sequential()
      model.add(Dense(8,input_dim=2,activation='relu'))
      for _ in range(n):
          model.add(Dense(32,activation='relu'))
      model.add(Dense(1,activation='sigmoid'))
      model.compile(loss='binary_crossentropy',optimizer='adam',metrics=['accuracy'])
      history = model.fit(X_train,y_train,epochs = 20, verbose=1)
      preds = model.predict_classes(np.c_[XX.ravel(), YY_ravel()])
      title = "网络层数({})".format(n)
      file = "网络容量 %f.png" %(2+n*1)
      make_plot(X_train,y_train, title,file,XX,YY,preds)
    

#+end_src

#+RESULTS:

*** tf.keras 

#+begin_src python :results output
  import tensorflow as tf
  from tensorflow import keras
  from tensorflow.keras import layers

  x = tf.constant([2., 1., 0.1])
  print(tf.keras.layers.Softmax(axis=-1)(x))
  print(tf.nn.softmax(x))

#+end_src

#+RESULTS:
: tf.Tensor([0.6590012  0.24243298 0.09856589], shape=(3,), dtype=float32)
: tf.Tensor([0.6590012  0.24243298 0.09856589], shape=(3,), dtype=float32)

tf.keras.Model 是tf.keras.Sequential的父类(网络类）
Sequential类还有方法：
Sequential.compile()
Sequential.fit()
Sequential.predict()

tf.keras.layers.Layer 是网络层类的父类（网络层类）

*** Eigenwertzerlegung eigende decompostion

对于矩阵求特征值特征向量，特征值分解，但是要求必须是方阵，如果不是，先
要转换： A = a*a.T


$$ A=UBU^T $$ 

#+begin_src python :results output
  import numpy as np
  a = np.mat([[1,2,3,4],[1,1,1,1]])
  A = a*a.T
  B, U = np.linalg.eig(A)
  print("eigenvalue of A : ")
  print(B)
  print("eigenvalue of a :(should be equal to the following) ")
  print(np.sqrt(B))
  print("eigenvactor : ")
  print(U)

#+end_src

#+RESULTS:
: eigenvalue of A : 
: [33.40121947  0.59878053]
: eigenvalue of a : 
: [5.77937881 0.77380911]
: eigenvactor : 
: [[ 0.94673755 -0.32200622]
:  [ 0.32200622  0.94673755]]

*** SVD Singular value decompostion

但是对于一般矩阵，不是方阵，可以奇异值分解：
$$ a = UBV^T , a^{t} = VBU^{T} $$
$$ A = aa^{T} = UB^{2}U^{T}$$
$$ A^{'}=a^{T}a=VB^{2}V^{T}$$

#+begin_src python :results output
  import numpy as np
  a = np.mat([[1,2,3,4],[1,1,1,1]])
  U, B, Vt = np.linalg.svd(a)
  print("left eigenvalue : ")
  print(U)
  print("eigenvactor of a : ")
  print(B)
  print("right eigenvalue : ")
  print(Vt)
#+end_src

#+RESULTS:
#+begin_example
left eigenvalue : 
[[-0.94673755 -0.32200622]
 [-0.32200622  0.94673755]]
eigenvactor of a : 
[5.77937881 0.77380911]
right eigenvalue : 
[[-0.21952944 -0.38334247 -0.5471555  -0.71096853]
 [ 0.80734554  0.3912142  -0.02491713 -0.44104847]
 [-0.40008743  0.25463292  0.69099646 -0.54554195]
 [-0.37407225  0.79697056 -0.47172438  0.04882607]]
#+end_example



**** 正则化正规化方程
$$w = (\Phi^{T}\Phi + \lambda I)^{-1} \Phi^{T}y $$


#+begin_src python :results output
  import numpy as np
  import random
  from sklearn import linear_model
  testsize = 5

  x = np.array([a for a in range(100)])
  onesx = np.ones(x.shape)
  X = np.c_[x,onesx]
  y = np.array([a*5 + 20 + random.randint(0,3) for a in range(100)])
  print("the X shape is {}, and y shape is {}".format(X.shape, y.shape))

  # weight = np.dot(np.dot(np.linalg.pinv(np.dot(X.T, X)), X.T), y)
  weight = np.linalg.inv(X.T.dot(X)).dot(X.T).dot(y)

  print("OLS : the weight is{}, and the bais is {} ".format(weight[:-1], weight[-1]))
  print("the predect of 5 ele is {}".format(np.dot(np.c_[np.arange(testsize),np.ones(testsize)], weight)))


#+end_src

#+RESULTS:
: the X shape is (100, 2), and y shape is (100,)
: OLS : the weight is[5.00063606], and the bais is 21.508514851485195 
: the predect of 5 ele is [21.50851485 26.50915092 31.50978698 36.51042304 41.51105911]

#+begin_src 
也可以是对变量 with multi variables
#+end_src

#+begin_src python :results output
  import numpy as np
  import random
  from sklearn import linear_model
  testsize = 5

  x = np.array([a for a in range(100)])
  onesx = np.ones(x.shape)
  X = np.c_[onesx, x, 2*x]
  y = np.array([a*5 + 20 + random.randint(0,3) for a in range(100)])
  print("the X shape is {}, and y shape is {}".format(X.shape, y.shape))

  # ordinary  least squares (正规化方法）
  weight = np.dot(np.dot(np.linalg.pinv(np.dot(X.T, X)), X.T), y)
  print("OLS : the weight is{}, and the bais is {} ".format(weight[:-1], weight[-1]))
  print("the predect of 5 ele is {}".format(np.dot(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)], weight)))


#+end_src

#+RESULTS:
: the X shape is (100, 3), and y shape is (100,)
: OLS : the weight is[21.35089109  0.9999964 ], and the bais is 1.999992799280042 
: the predect of 5 ele is [ 1.9999928  24.35088029 46.70176778 69.05265527 91.40354275]

*** gradient decent
当数据点很多是，正则化方法计算量将非常大，此时较多使用梯度下降

#+begin_src 
sklearn API
#+end_src

#+begin_src python :results output

  import numpy as np
  import random
  from sklearn import linear_model
  testsize = 5

  x = np.array([a for a in range(100)])
  onesx = np.ones(x.shape)
  X = np.c_[x, 2*x, onesx]
  y = np.array([a*5 + 20 + random.randint(0,3) for a in range(100)])
  print("the X shape is {}, and y shape is {}".format(X.shape, y.shape))

  # Sklearn API
  reg = linear_model.LinearRegression()
  model = reg.fit(X,y)
  print("Sklearn: the weith is {}, and the intercept is {}".format(model.coef_[:-1] ,model.intercept_))
  print("the predect of 3 ele is {}".format(model.predict(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)])))


  # manual 
  def featureNormalize(X):
      (m,n) = X.shape
      X_norm = X
      mu = np.zeros(n);
      sigma = np.zeros(n);
      for i in range(n):
          mu[i] = np.mean(X[:,i])
          sigma[i] = np.std(X[:,i])
          X_norm[:,i] = (X_norm[:,i]-mu[i])/sigma[i]
      return X_norm
  def computeCost(X, y, theta):
      return np.sum((np.dot(X,theta) -y)**2)/(2*len(y));

  def gradientDescent(X, y, theta, alpha, num_iters):
      m = len(y)
      J_history = np.zeros(num_iters);
      theta_len = len(theta);
      for num_iter in range(num_iters):
          theta = theta - (alpha/m)*np.dot(X.T,(np.dot(X,theta).reshape(-1)-y))
          J_history[num_iter] = computeCost(X, y, theta)
      return theta, J_history

  alpha = 0.0001
  num_iters = 400000
  theta = np.zeros(2+1)
  theta, J_history = gradientDescent(X, y, theta, alpha, num_iters)
  print("Greadient decent: the weight is {}, and the intercept is {}".format(theta[:-1],theta[-1]))
  print("the predect of 3 ele is {}".format(np.dot(np.c_[np.arange(testsize), np.arange(testsize),np.ones(testsize)], theta)))
#+end_src

#+RESULTS:
: the X shape is (100, 3), and y shape is (100,)
: Sklearn: the weith is [0.99925113 1.99850225], and the intercept is 21.64534653465344
: the predect of 3 ele is [21.64534653 24.64309991 27.64085329 30.63860666 33.63636004]
: Greadient decent: the weight is [0.99925367 1.99850734], and the intercept is 21.64450170230179
: the predect of 3 ele is [21.6445017  24.64226272 27.64002374 30.63778475 33.63554577]

